{
    "load_raw_dataset": true,
    "data_paths": "[/home/aiscuser/Code-Qwen/20231213_chat/CodeExercise,/home/aiscuser/Code-Qwen/20231213_chat/CodeFix,/home/aiscuser/Code-Qwen/20231213_chat/evol]",
    "output_dir": "/home/aiscuser/Code-Qwen/output/20231216_2",
    "tb_dir": "/home/aiscuser/Code-Qwen/output/20231216_2/tblog",
    "pretrained_model_path": "/home/aiscuser/Code-Qwen/Qwen-1_8B-Chat",
    "vocab_file": "/home/aiscuser/Code-Qwen/Qwen-1_8B-Chat",
    "low_cpu_mem_usage": true,
    "data_split": "95,5,0",
    "padding_mode": "padding",
    "tokenize_mode": "sft",
    "weighted_loss_mode": "case3",
    "model_type": "qwen",
    "peft_type": "lora",
    "quantization": "16bit",
    "lora_rank": 128,
    "lora_alpha": 256,
    "lora_dropout": 0.05,
    "per_device_train_batch_size": 2,
    "per_device_eval_batch_size": 2,
    "tokenizer_type": "AutoTokenizer",
    "learning_rate": 5e-5,
    "min_lr": 1e-6,
    "weight_decay": 0.1,
    "gradient_accumulation_steps": 1,
    "lr_scheduler_type": "cosine",
    "num_warmup_steps": 300,
    "num_train_epochs": 10,
    "seed": 1234,
    "seq_length": 4096,
    "resume_from_checkpoint": null,
    "log_interval": 10,
    "checkpointing_steps": 2000,
    "evalation_steps": 2000,
    "max_train_steps": null,
    "epoch_checkpointing": true,
    "shuffle_before_split": true,
    "use_random_sampler": true,
    "early_stopping": false,
    "early_stopping_stall_num": 2,
    "weight_by_num_documents": true,
    "make_vocab_size_divisible_by": 128,
    "model_parallel_size": 1,
    "use_slow_tokenizer": false,
    "use_xformers": true,
    "trust_remote_code": true,
    "use_dynamic_padding": true,
    "world_size": 8
}